driver-tests/smtpbc/SMTPBCTests/OneWayTestJBI/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:smt="http://j2ee.netbeans.org/wsdl/SMTPOneWayTrigger">
  <soapenv:Body>
    <smt:SMTPOneWayTriggerOperation>
      <part1>sometext</part1>
    </smt:SMTPOneWayTriggerOperation>
  </soapenv:Body>
</soapenv:Envelope>